<?php if(! defined('BASEPATH')) exit ('No direct script access allowed');
class Date_ex_01 extends CI_Controller {
    function __construct(){
        parent::__construct();
    }
    public function index ()
    {
       // ฟังก์ชั่น date(รูปแบบวันเวลา, timestamp) เป็นฟังก์ชั่นที่ใช้ในการจัดรูปแบบวันเวลาให้ตรงกับรูปแบบของแต่ล่ะท้องถิ่น ซึ้งค่า
       // timestamp คือวันเวลาที่ต้องการ หากไม่กำหนดถือว่าเป็นวันเวลาปัจจุบัน
       $birth = strtotime("01/10/2000"); // แปลงสตริงเป็นค่า timestamp 

       echo date("ดิฉันเกิดเมื่อ j-m-Y", $birth);

       $days = array("อาทิตย์", "จันทร์", "อังคาร", "พุธ", "พฤหัสบดี", "ศุกร์", "เสาร์"); // เก็บวัน จันทร์ - อาทิตย์ ไว้ใน array
       $months = array(1=>"มกราคม","กุมภาพันธ์", "มีนาคม", "เมษายน", "พฤษภาคม", "มิถุนายน", "กรกฎาคม", "สิงหาคม", "กันยายน", "ตุลาคม", "พฤษจิกายน", "ธันวาคม");
       // เก็บเดือนทั้ง 12 ไว้ใน array มี key เริ่มต้นที่ 1

       $d = date('w'); // ลำดับของวันในรอบสัปดาห์ (0-6) ไม่ใส่ timestamp เป็นลำดับของวันเวลาปัจจุบัน
       
       $day = $days[$d]; //เอาลำดับของวันในรอบสัปดาห์ $d มาเป็น key ให้กับ วัน เราก็จะรู้ว่า วันใน array $days ตรงกับวันไหนในสัปดาห์นี้
       // ชื่อวันจะเป็นภาษาไทย

       $date = date('j'); //วันที่ ปัจจุบัน แบบไม่มี 0 นำหน้า

       $m = date('n'); // ลำดับของเดือนแบบไม่มี 0 นำหน้า (1-12) ลำดับของเดือนปัจจุบัน
       $month = $months[$m];

       $year = date('Y') + 543; // ปี พ.ศ Y ใช้แทนปี ค.ศ แบบเลข 4 หลัก เช่น 1975 (ถ้าบวก 543 จะเป็น พ.ศ แบบไทย)

       echo "<br> วันนี้ตรงกับวัน $day วันที่ $date เดือน $month ปี $year <br>";
       echo date("ขณะนี้เวลา H:i:s"); // อักขระที่ใช้แทนเวลา H ใช้แทนค่าชั่วโมงของวันแบบ 24 ชั่วโมงโดยมี 0 นำหน้าเลขหลักเดียวระหว่าง 00-23
       // i ค่านาทีแบบมี 0 นำหน้าเลขหลักเดียวจาก 00-59 s ค่าวินาทีแบบมี 0 นำหน้าเลขหลักเดียวจาก 00-59
    }
}